package DataStructure.CH5_Tree.LowestCommonAncestor;


/*****************************************************************
 * @Author:FlashXT;
 * @Date: 2019/5/19 13:57
 * @Version 1.0
 * CopyRight © 2018-2020,FlashXT & turboMan . All Right Reserved.
 *****************************************************************/
/********************************************************************
 * LCA问题2：二叉树为普通的二叉树，但是每个结点包含指向其父结点的指针，此时问题
 *          转化为求两个链表的公共结点；要注意两个链表长度不等的情况；
 *******************************************************************/

public class LCABST02 {

}
